{
  "education": [
    {
      "school": "Qwasar Silicon Valley",
      "degree": "Masters Computer Science",
      "year": "2025",
      "details": [
        "Pursuing an advanced degree focused on practical software engineering, maintaining high quality of craftsmanship while specializing in systems architecture",
        "Mastering advanced algorithms and data structures through intensive project-based learning, with emphasis on optimization and scalability",
        "Developing expertise in systems and webassembly programming using Rust, while expanding proficiency in C++, Go, and C through advanced coursework",
        "Implementing complex embedded systems projects, gaining deep understanding of hardware-software integration and performance optimization",
        "Examples of projects include building virtual machines, high-throughput networking applications, event-driven systems, and AI engineering with local LLMs"
      ]
    },
    {
      "school": "Lighthouse Labs",
      "degree": "Diploma of Full Stack Web Development",
      "year": "July 2020 to Oct. 2020",
      "details": [
        "Completed rigorous 12-week immersive program with distinction, focusing on modern full-stack development methodologies",
        "Architected and deployed multiple full-stack applications utilizing Node.js, Express, and MongoDB, emphasizing scalable design patterns",
        "Implemented industry-standard Git workflows and collaborative development practices in team-based projects",
        "Delivered capstone project that earned recognition for technical innovation and clean code architecture"
      ]
    },
    {
      "school": "Brainstation",
      "degree": "Certificate in Cyber Security Essentials",
      "year": "Sept. 2022 to Dec. 2022",
      "details": [
        "Implemented comprehensive security protocols and best practices in real-world scenarios, achieving top marks in practical assessments",
        "Executed detailed vulnerability assessments and penetration testing procedures, developing strategic mitigation strategies",
        "Researched and analyzed emerging cybersecurity threats, contributing to development of proactive security frameworks"
      ]
    },
    {
      "school": "Brainstation",
      "degree": "Certificate in UX Design",
      "year": "Nov. 2021 to Jan. 2022",
      "details": [
        "Mastered user-centered design principles through practical application in multiple client-focused projects",
        "Conducted comprehensive user research and analysis, translating findings into actionable design strategies",
        "Created high-fidelity prototypes and conducted extensive usability testing, resulting in measurable UX improvements"
      ]
    },
    {
      "school": "Brainstation",
      "degree": "Certificate in HTML and CSS",
      "year": "May 2020 to June 2020",
      "details": [
        "Mastered modern web development fundamentals, achieving perfect scores on all practical assessments",
        "Developed responsive, accessible websites utilizing advanced CSS frameworks and methodologies",
        "Implemented modern CSS architectures including Grid, Flexbox, and CSS custom properties for scalable designs"
      ]
    },
    {
      "school": "Lighthouse Labs",
      "degree": "Certificate in Front End Development",
      "year": "May 2020 to June 2020",
      "details": [
        "Excelled in front-end development fundamentals, focusing on modern JavaScript frameworks and libraries",
        "Implemented complex asynchronous operations and API integrations using modern JavaScript practices",
        "Developed responsive, interactive web applications emphasizing performance optimization and user experience"
      ]
    }
  ]
}
