{
  "employment": [
    {
      "company": "Shopify",
      "position": "Senior Software Engineer",
      "duration": "Jun 2022 - Present",
      "responsibilities": [
        "Architect and implement scalable merchant-facing systems with strong performance and reliability constraints.",
        "Collaborate across product and engineering to translate complex requirements into maintainable technical solutions.",
        "Drive quality through testing, observability, and iterative rollout strategies to reduce production risk."
      ]
    },
    {
      "company": "Lighthouse Labs",
      "position": "Technical Instructor, Mentor, and Project Evaluator",
      "duration": "Nov 2020 - Mar 2024",
      "responsibilities": [
        "Mentored 150+ students across software engineering topics with an emphasis on practical shipping skills.",
        "Built structured learning plans to improve technical confidence and project completion consistency.",
        "Performed detailed code reviews and assessments focused on industry-grade quality and communication."
      ]
    },
    {
      "company": "Springboard Bootcamp",
      "position": "Technical Mentor",
      "duration": "Jul 2023 - Mar 2024",
      "responsibilities": [
        "Led weekly mentorship sessions on full-stack engineering and production-minded development.",
        "Designed individualized growth plans based on project outcomes and technical gaps.",
        "Facilitated deep-dive discussions and review cycles around architecture, testing, and delivery."
      ]
    },
    {
      "company": "TWG, a Deloitte Business",
      "position": "Software Engineer",
      "duration": "May 2021 - Jun 2022",
      "responsibilities": [
        "Engineered high-performance React and TypeScript interfaces backed by GraphQL services.",
        "Implemented GraphQL APIs in a Ruby on Rails ecosystem to improve data retrieval and developer ergonomics.",
        "Contributed to legacy modernization programs that improved maintainability and reduced operational drag."
      ]
    }
  ]
}
